/*
选择排序（数组）

题目描述
输入n个数字，使用选择排序对齐进行升序排序。

输入
测试次数T
每组测试数据格式为：数字个数n，后跟n个数字，假设n<20

输出
对每组测试数据，输出选择排序的每趟排序结果

样例输入
2
5 10 4 43 1 2
10 20 123 12 2 434 54 2 45 23 -10

样例输出
1 4 43 10 2
1 2 43 10 4
1 2 4 10 43
1 2 4 10 43
-10 123 12 2 434 54 2 45 23 20
-10 2 12 123 434 54 2 45 23 20
-10 2 2 123 434 54 12 45 23 20
-10 2 2 12 434 54 123 45 23 20
-10 2 2 12 20 54 123 45 23 434
-10 2 2 12 20 23 123 45 54 434
-10 2 2 12 20 23 45 123 54 434
-10 2 2 12 20 23 45 54 123 434
-10 2 2 12 20 23 45 54 123 434
*/

#include<stdio.h>

int main()
{
	int T,n,i,j,k,m;
	scanf("%d",&T);
	while(T--){
		int a[20];
		scanf("%d",&n);
		for(i=0;i<n;i++){
			scanf("%d",&a[i]);
		}
		for(i=0;i<n-1;i++){
			k=i;
			for(j=i+1;j<n;j++){
				if(a[k]>a[j]){
					k=j;
				}
			}
			m=a[k];
			a[k]=a[i];
			a[i]=m;
			for(j=0;j<n-1;j++)
				printf("%d ",a[j]);
			printf("%d\n",a[j]);
		}
	}
}
