/*

递归实现斐波那契数列
时间限制: 1 Sec  内存限制: 128 MB
提交: 160  解决: 142
[提交][状态][讨论版]
题目描述


斐波那契数列的定义如下：

 
也就是说，斐波那契数列由1 和1开始，之后的每一项是之前的两数相加，例如:

 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233,...

要求用递归函数实现，求斐波那契数列第n项的值。

输入


测试次数和每次要计算的项数

输出


计算的结果

样例输入

5
1
2
5
10
20


样例输出

1
1
5
55
6765

*/

#include<stdio.h>

void FeiBo(int a,int b,int i,int n)
{
	if(i==n){
		printf("%d\n",a+b);
	}else{
		FeiBo(b,a+b,i+1,n);
	}
}

int main()
{
	int t,n;
	scanf("%d",&t);
	while(t--){
		scanf("%d",&n);
		if(n==1||n==2){
			printf("1\n");
		}else{
			FeiBo(1,1,1,n-2);
		}
	}
}
